import streamlit as st

st.title('อุณหภูมิเฉลี่ยของประเทศไทยรายเดือน')
st.write('''
            เดือนกุมภาพันธ์
เดือนนี้เป็นเดือนที่เปลี่ยนจากฤดูหนาวเข้าสู่ฤดูร้อน ในระยะแรกลักษณะอากาศจะแปรปรวน โดยยังคงมีอากาศหนาวเย็นในตอนเช้าโดยเฉพาะบริเวณภาคเหนือและภาคตะวันออกเฉียงเหนือ ส่วนในตอนกลางวันจะเริ่มมีอากาศร้อน ส่วนมากในระยะปลายเดือนอุณหภูมิเฉลี่ย ต่ำกว่าค่าปกติเล็กน้อยปริมาณฝน สูงกว่าค่าปกติเล็กน้อย

เดือนมีนาคม
อยู่ในช่วงฤดูร้อน ในระยะแรกบริเวณภาคเหนือและภาคตะวันออกเฉียงเหนือยังคงมีอากาศเย็น กับมี หมอกในตอนเช้า ส่วนในตอนกลางวันประเทศไทยตอนบนจะมีอากาศร้อนอบอ้าว เนื่องจากในบางช่วงจะมีหย่อมความกดอากาศต่ำเนื่องจากความร้อนปกคลุมบริเวณดังกล่าวและอาจมีอากาศร้อนจัดบางพื้นที่อุณหภูมิสูงสุด 40 - 41ซ.โดยเฉพาะในช่วงครึ่งหลังของเดือนอุณหภูมิเฉลี่ย ต่ำกว่าค่าปกติเล็กน้อยปริมาณฝน สูงกว่าค่าปกติเล็กน้อย

เดือนเมษายน
ยังอยู่ในช่วงฤดูร้อน หย่อมความกดอากาศต่ำเนื่องจากความร้อนจะปกคลุมประเทศไทยตอนบน ทำให้มี อากาศร้อน และอากาศร้อนจัดในบางพื้นที่ ส่วนมากในภาคเหนือ และภาคตะวันออกเฉียงเหนือ อุณหภูมิสูงสุด 40—42 ๐ซ. แต่ในบางช่วงจะมีแนวพัดสอบของลมใต้และตะวันออกเฉียงใต้พาดผ่านทำให้มีฝนฟ้าคะนองกระจายซึ่งจะช่วยคลายความร้อนลงไปได้อุณหภูมิเฉลี่ย ต่ำกว่าค่าปกติเล็กน้อยปริมาณฝน สูงกว่าค่าปกติเล็กน้อย
         ''')

page_bg_img = '''<style>
.stApp {
    background-image: url("https://images.pexels.com/photos/1707213/pexels-photo-1707213.jpeg");
    background-size: cover;
}
</style>'''
st.markdown(page_bg_img, unsafe_allow_html=True)